title: Splunk sigma EventCode 5156
id: 43ac3943-f02a-4d4e-b422-10d3a448c01c
name: splunk_sigma_eventcode_5156
status: test
description: Should match 28295 events
logsource:
  category: '*'
  product: '*'
detection:
  selection:
    EventCode:
      - 5156
    Nome_applicazione:
      - "\\device\\harddiskvolume2\\program files\\intergraph smart licensing\\client\\islclient.exe"
  condition: selection

level: informational
