title: Match some event sequence numbers
id: 51cc4c8c-6acb-4bfd-b177-aaf73ff4c96f
name: match_some_event_sequence_numbers
status: test
description: Matches events with sequence numbers 352, 353, 354, and 355
logsource:
  category: '*'
  product: '*'
detection:
  selection:
    event.sequence:
      - 352
      - 353
      - 354
      - 355
  condition: selection
falsepositives:
    - 'Events with matching sequence numbers but different context'

level: informational
