title: Match some more event sequence numbers
id: fae7f261-10e0-4325-8914-90733c8a38f9
name: match_some_more_event_sequence_numbers
status: test
description: Matches events with sequence numbers 352, 125, 126
logsource:
  category: '*'
  product: '*'
detection:
  selection:
    event.sequence:
      - 125
      - 126
  condition: selection
falsepositives:
    - 'Events with matching sequence numbers but different context'

level: informational
